Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: :ref:`addon-weblate.cleanup.generic` is now automatically installed for formats which need it to update non-translation content in the translated files.
sv: :ref:`addon-weblate.cleanup.generic` installeras nu automatiskt fÃ¶r format som behÃ¶ver det fÃ¶r att uppdatera icke-Ã¶versatt innehÃ¥ll i de Ã¶versatta filerna.

source: Support for using Docker network names in automatic suggestion settings.
sv: StÃ¶d fÃ¶r anvÃ¤ndning av Docker-nÃ¤tverksnamn i instÃ¤llningarna fÃ¶r automatiska fÃ¶rslag.

source: Fixed authentication using some third-party providers such as Azure.
sv: Fast autentisering med hjÃ¤lp av vissa tredjepartsleverantÃ¶rer, sÃ¥som Azure.

source: Support for formal and informal Portuguese in :ref:`mt-deepl`.
sv: StÃ¶d fÃ¶r formell och informell portugisiska i :ref:`mt-deepl`.

source: QR code for TOTP is now black/white even in dark mode.
sv: QR-koden fÃ¶r TOTP Ã¤r nu svart/vit Ã¤ven i mÃ¶rkt lÃ¤ge.

source: Fixed TOTP authentication when WebAuthn is also configured for the user.
sv: Fixade TOTP-autentisering nÃ¤r WebAuthn ocksÃ¥ Ã¤r konfigurerat fÃ¶r anvÃ¤ndaren.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/125?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/125?closed=1>`__.

source: *Released on August 15th 2024.*
sv: *SlÃ¤pptes den 15 augusti 2024.*

source: :ref:`2fa` is now supported using Passkeys, WebAuthn, authentication apps (TOTP), and recovery codes.
sv: :ref:`2fa` stÃ¶ds nu med hjÃ¤lp av passnycklar, WebAuthn, autentiseringsappar (TOTP) och Ã¥terstÃ¤llningskoder.

source: :ref:`2fa` can be enforced at the team or project level.
sv: :ref:`2fa` kan tillÃ¤mpas pÃ¥ team- eller projektnivÃ¥.

source: :ref:`adding-new-strings` can now create plural strings in the user interface.
sv: :ref:`adding-new-strings` kan nu skapa pluralstrÃ¤ngar i anvÃ¤ndargrÃ¤nssnittet.

source: :ref:`labels` now include description to explain them.
sv: :ref:`labels` innehÃ¥ller nu en beskrivning som fÃ¶rklarar dem.

source: New :ref:`notifications` for completed translation and component.
sv: Nytt :ref:`notifications` fÃ¶r fÃ¤rdigstÃ¤lld Ã¶versÃ¤ttning och komponent.

source: :ref:`mt-openai` now supports custom models and URLs and offers rephrasing of existing strings.
sv: :ref:`mt-openai` stÃ¶der nu anpassade modeller och URL:er och erbjuder omformulering av befintliga strÃ¤ngar.

source: :ref:`mt-cyrtranslit` automatic suggestion service.
sv: :ref:`mt-cyrtranslit` automatisk fÃ¶rslagstjÃ¤nst.

source: :ref:`addon-weblate.properties.sort` can now do case-sensitive sorting.
sv: :ref:`addon-weblate.properties.sort` kan nu sortera med hÃ¤nsyn till versaler och gemener.

source: The status widgets are now supported site-wide and language-wide, see :ref:`promotion`.
sv: Statuswidgetarna stÃ¶ds nu pÃ¥ hela webbplatsen och fÃ¶r alla sprÃ¥k, se :ref:`promotion`.

source: :ref:`reports` are now available for categories.
sv: :ref:`reports` finns nu tillgÃ¤ngliga fÃ¶r kategorier.

source: Highlight newlines in the editor.
sv: Markera radbrytningar i redigeraren.

source: :doc:`/formats/csv` better handle files with two fields only.
sv: :doc:`/formats/csv` hanterar bÃ¤ttre filer med endast tvÃ¥ fÃ¤lt.

source: Browse mode can now be navigated using keyboard, see :ref:`keyboard`.
sv: BlÃ¤ddringlÃ¤get kan nu navigeras med tangentbordet, se :ref:`keyboard`.

source: :http:get:`/api/components/(string:project)/(string:component)/credits/` and :http:get:`/api/projects/(string:project)/credits/` API endpoints for components and projects.
sv: :http:get:`/api/components/(string:project)/(string:component)/credits/` och :http:get:`/api/projects/(string:project)/credits/` API-slutpunkter fÃ¶r komponenter och projekt.

source: :ref:`glossary-terminology` entries in Glossary can now only be created by users with :guilabel:`Add glossary terminology` permission.
sv: :ref:`glossary-terminology`-poster i ordlistan kan nu endast skapas av anvÃ¤ndare med behÃ¶righeten :guilabel:`LÃ¤gg till ordlisteterminologi`.

source: :ref:`check-python-brace-format` detects extra curly braces.
sv: :ref:`check-python-brace-format` upptÃ¤cker extra klamrar.

source: Screenshots now can be pasted from the clipboard in :ref:`screenshots`.
sv: SkÃ¤rmdumpar kan nu klistras in frÃ¥n urklipp i :ref:`screenshots`.

source: Accessibility of keyboard navigation.
sv: TillgÃ¤nglighet fÃ¶r tangentbordsnavigering.

source: :ref:`git-exporter` now works with all Git based :ref:`vcs`.
sv: :ref:`git-exporter` fungerar nu med alla Git-baserade :ref:`vcs`.

source: :ref:`check-max-size` sometimes failed to render screenshot.
sv: :ref:`check-max-size` misslyckades ibland med att rendera skÃ¤rmdumpen.

source: Weblate now uses mistletoe instead of misaka as a Markdown renderer.
sv: Weblate anvÃ¤nder nu mistletoe istÃ¤llet fÃ¶r misaka som Markdown-renderare.

source: :ref:`csp` is now stricter what might block third-party customizations.
sv: :ref:`csp` Ã¤r nu strÃ¤ngare, vilket kan blockera anpassningar frÃ¥n tredje part.

source: Monolingual formats no longer copy comments from :ref:`component-template` when adding strings to translation.
sv: EnsprÃ¥kiga format kopierar inte lÃ¤ngre kommentarer frÃ¥n :ref:`component-template` nÃ¤r strÃ¤ngar lÃ¤ggs till i Ã¶versÃ¤ttningen.

source: Dropped support for Amagama in :ref:`machine-translation-setup` as the service is no longer maintained.
sv: StÃ¶det fÃ¶r Amagama har tagits bort i :ref:`machine-translation-setup` eftersom tjÃ¤nsten inte lÃ¤ngre underhÃ¥lls.

source: Default value for :setting:`SENTRY_SEND_PII` was changed.
sv: StandardvÃ¤rdet fÃ¶r :setting:`SENTRY_SEND_PII` har Ã¤ndrats.

source: Translation credit reports in the JSON format now follows a different format for entries.
sv: ÃversÃ¤ttningskreditrapporter i JSON-format fÃ¶ljer nu ett annat format fÃ¶r poster.

source: There are several changes in :file:`settings_example.py`, most notable are the new settings for :ref:`2fa` and changes in ``INSTALLED_APPS``, ``SOCIAL_AUTH_PIPELINE`` and ``MIDDLEWARE``; please adjust your settings accordingly.
sv: Det finns flera Ã¤ndringar i :file:`settings_example.py`, de mest anmÃ¤rkningsvÃ¤rda Ã¤r de nya instÃ¤llningarna fÃ¶r :ref:`2fa` och Ã¤ndringarna i ``INSTALLED_APPS``, ``SOCIAL_AUTH_PIPELINE`` och ``MIDDLEWARE``; justera dina instÃ¤llningar dÃ¤refter.

source: :setting:`ENABLE_HTTPS` is now required for WebAuthn support. If you cannot use HTTPS, please silence related check as described in :setting:`ENABLE_HTTPS` documentation.
sv: :setting:`ENABLE_HTTPS` krÃ¤vs nu fÃ¶r stÃ¶d fÃ¶r WebAuthn. Om du inte kan anvÃ¤nda HTTPS, vÃ¤nligen inaktivera relaterad kontroll enligt beskrivningen i dokumentationen fÃ¶r :setting:`ENABLE_HTTPS`.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/116?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/116?closed=1>`__.

source: *Released on July 1st 2024.*
sv: *SlÃ¤pptes den 1 juli 2024.*

source: Rendering of :ref:`labels` color selection widget.
sv: Rendering av :ref:`labels` fÃ¤rgvalswidget.

source: Detection of pending outgoing commits.
sv: Detektering av vÃ¤ntande utgÃ¥ende commit.

source: :ref:`addons` button layout.
sv: :ref:`addons` knappens layout.

source: Crash when installing :ref:`addon-weblate.discovery.discovery` add-on.
sv: Krasch vid installation av tillÃ¤gget :ref:`addon-weblate.discovery.discovery`.

source: Removal of source strings in :ref:`glossary`.
sv: Borttagning av kÃ¤llstrÃ¤ngar i :ref:`glossary`.

source: Validation of :ref:`projectbackup` ZIP file upon restoring (:cve:`2024-39303` / :ghsa:`jfgp-674x-6q4p`).
sv: Validering av :ref:`projectbackup` ZIP-fil vid Ã¥terstÃ¤llning (:cve:`2024-39303` / :ghsa:`jfgp-674x-6q4p`).

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/124?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/124?closed=1>`__.

source: *Released on June 24th 2024.*
sv: *SlÃ¤pptes den 24 juni 2024.*

source: Docker container accepts :envvar:`WEBLATE_REMOVE_ADDONS` and :envvar:`WEBLATE_ADD_MACHINERY` to customize automatic suggestion services and :envvar:`WEBLATE_CORS_ALLOW_ALL_ORIGINS` for CORS handling in API.
sv: Docker-containern accepterar :envvar:`WEBLATE_REMOVE_ADDONS` och :envvar:`WEBLATE_ADD_MACHINERY` fÃ¶r att anpassa automatiska fÃ¶rslagstjÃ¤nster och :envvar:`WEBLATE_CORS_ALLOW_ALL_ORIGINS` fÃ¶r CORS-hantering i API.

source: Added OpenMetrics compatibility for :http:get:`/api/metrics/`.
sv: Lagt till OpenMetrics-kompatibilitet fÃ¶r :http:get:`/api/metrics/`.

source: Language aliases in :doc:`/admin/machine`.
sv: SprÃ¥kliga alias i :doc:`/admin/machine`.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/123?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/123?closed=1>`__.

source: *Released on June 19th 2024.*
sv: *SlÃ¤pptes den 19 juni 2024.*

source: :ref:`addons` activity log for tracking add-on activity.
sv: :ref:`addons` aktivitetslogg fÃ¶r spÃ¥rning av tillÃ¤ggsaktivitet.

source: Improved date range selection in :ref:`reports`.
sv: FÃ¶rbÃ¤ttrad val av datumintervall i :ref:`reports`.

source: :ref:`notifications` now include strings which need updating.
sv: :ref:`notifications` innehÃ¥ller nu strÃ¤ngar som behÃ¶ver uppdateras.

source: Improved compatibility with password managers.
sv: FÃ¶rbÃ¤ttrad kompatibilitet med lÃ¶senordshanterare.

source: Improved tracking of uploaded changes.
sv: FÃ¶rbÃ¤ttrad spÃ¥rning av uppladdade Ã¤ndringar.

source: Gracefully handle temporary machine translation errors in automatic suggestions.
sv: Hantera tillfÃ¤lliga maskinÃ¶versÃ¤ttningsfel i automatiska fÃ¶rslag pÃ¥ ett elegant sÃ¤tt.

source: :http:get:`/api/units/(int:id)/` now includes ``last_updated`` timestamp.
sv: :http:get:`/api/units/(int:id)/` innehÃ¥ller nu tidsstÃ¤mpeln ``last_updated``.

source: :http:get:`/api/changes/(int:id)/` now includes ``old`` and ``details``.
sv: :http:get:`/api/changes/(int:id)/` innehÃ¥ller nu ``old`` och ``details``.

source: Reduced memory usage and increased performance of some views.
sv: Minskad minnesanvÃ¤ndning och Ã¶kad prestanda fÃ¶r vissa vyer.

source: Loading of strings with many glossary matches.
sv: InlÃ¤sning av strÃ¤ngar med mÃ¥nga ordlistematchningar.

source: Fixed behavior of some site-wide :ref:`addons`.
sv: Fast beteende fÃ¶r vissa :ref:`addons` som gÃ¤ller hela webbplatsen.

source: Saving strings needing editing to :doc:`/formats/winrc`.
sv: Spara strÃ¤ngar som behÃ¶ver redigeras till :doc:`/formats/winrc`.

source: :ref:`check-xml-tags` better handle XML entities.
sv: :ref:`check-xml-tags` hanterar XML-enheter bÃ¤ttre.

source: Automatic suggestions could mix up replacements between translated strings.
sv: Automatiska fÃ¶rslag kan blanda ihop ersÃ¤ttningar mellan Ã¶versatta strÃ¤ngar.

source: Compatibility with Django 5.1.
sv: Kompatibilitet med Django 5.1.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/114?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/114?closed=1>`__.

source: *Released on May 13th 2024.*
sv: *SlÃ¤pptes den 13 maj 2024.*

source: False-positive merge failure alert when using push branch.
sv: Falsk positiv varning om misslyckad sammanslagning vid anvÃ¤ndning av push-gren.

source: Cleanup of stale repositories.
sv: Rensning av gamla arkiv.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/121?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/121?closed=1>`__.

source: *Released on May 10th 2024.*
sv: *SlÃ¤pptes den 10 maj 2024.*

source: Visually highlight explanation in :ref:`glossary`.
sv: Markera fÃ¶rklaringen visuellt i :ref:`glossary`.

source: Add :ref:`addons` history tab in management.
sv: LÃ¤gg till :ref:`addons` historikfliken i hanteringen.

source: New :ref:`alerts` when :ref:`glossary` might not work as expected.
sv: Nytt :ref:`alerts` nÃ¤r :ref:`glossary` kanske inte fungerar som fÃ¶rvÃ¤ntat.

source: :doc:`/admin/announcements` can be posted on project/language scope.
sv: :doc:`/admin/announcements` kan publiceras pÃ¥ projekt-/sprÃ¥knivÃ¥.

source: Improved handling placeables in :ref:`mt-openai`.
sv: FÃ¶rbÃ¤ttrad hantering av placerbara objekt i :ref:`mt-openai`.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/120?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/120?closed=1>`__.

source: *Released on May 3rd 2024.*
sv: *SlÃ¤pptes den 3 maj 2024.*

source: Improved performance of rendering large lists of objects.
sv: FÃ¶rbÃ¤ttrad prestanda vid rendering av stora listor med objekt.

source: Component management: added links to manage project/site-wide :ref:`addons`.
sv: Komponenthanteering: lÃ¤nkar har lagts till fÃ¶r att hantera :ref:`addons` fÃ¶r hela projektet/webbplatsen.

source: Fixed crashes with librsvg older than 2.46.
sv: Fixade krascher med librsvg Ã¤ldre Ã¤n 2.46.

source: Daily execution of some :ref:`addons`.
sv: Daglig kÃ¶rning av vissa :ref:`addons`.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/119?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/119?closed=1>`__.

source: *Released on April 26th 2024.*
sv: *SlÃ¤ppt den 26 april 2024.*

source: Fixed publishing packages to PyPI.
sv: Fixade publiceringspaket till PyPI.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/118?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/118?closed=1>`__.

source: :doc:`/user/search` supports ``source_changed:DATETIME``.
sv: :doc:`/user/search` stÃ¶der ``source_changed:DATETIME``.

source: Added several new :ref:`component-language_code_style`.
sv: Lade till flera nya :ref:`component-language_code_style`.

source: Display more details on source string change in history.
sv: Visa mer information om Ã¤ndringar i kÃ¤llstrÃ¤ngen i historiken.

source: :ref:`mt-microsoft-translator` now supports using custom translators.
sv: :ref:`mt-microsoft-translator` stÃ¶der nu anvÃ¤ndning av anpassade Ã¶versÃ¤ttare.

source: Improved error handling in :ref:`invite-user`.
sv: FÃ¶rbÃ¤ttrad felhantering i :ref:`invite-user`.

source: Added PNG status badge.
sv: PNG-statusmÃ¤rke tillagt.

source: Added list of managed projects to the dashboard view.
sv: Lista Ã¶ver hanterade projekt har lagts till i instrumentpanelsvyn.

source: More detailed status of outgoing commits.
sv: Mer detaljerad status fÃ¶r utgÃ¥ende commit.

source: Reduced memory usage.
sv: Minskad minnesanvÃ¤ndning.

source: Fixed skipped component update with some add-ons enabled.
sv: Fixat problem med att komponenter inte uppdaterades nÃ¤r vissa tillÃ¤gg var aktiverade.

source: Daily execution of project and site wide add-ons.
sv: Daglig genomfÃ¶rande av projekt och tillÃ¤gg fÃ¶r hela webbplatsen.

source: Allow editing strings when the source is marked for editing.
sv: TillÃ¥t redigering av strÃ¤ngar nÃ¤r kÃ¤llan Ã¤r markerad fÃ¶r redigering.

source: Updates of the last updated timestamp of a string.
sv: Uppdateringar av den senaste uppdaterade tidsstÃ¤mpeln fÃ¶r en strÃ¤ng.

source: Fixed project and site wide installation of :ref:`addon-weblate.git.squash` and :ref:`addon-weblate.discovery.discovery` add-ons.
sv: Fast projekt och webbplatsomfattande installation av :ref:`addon-weblate.git.squash` och :ref:`addon-weblate.discovery.discovery` tillÃ¤gg.

source: Graceful handling of locking errors in the :ref:`api`.
sv: Elegant hantering av lÃ¥sningsfel i :ref:`api`.

source: There is a change in ``REST_FRAMEWORK`` setting (newly added ``EXCEPTION_HANDLER``).
sv: Det har skett en Ã¤ndring i instÃ¤llningen ``REST_FRAMEWORK`` (nyligen tillagd ``EXCEPTION_HANDLER``).

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/117?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/117?closed=1>`__.

source: *Released on April 20th 2024.*
sv: *SlÃ¤pptes den 20 april 2024.*

source: :ref:`addons` can be now installed project-wide and site-wide.
sv: :ref:`addons` kan nu installeras fÃ¶r hela projektet och hela webbplatsen.

source: API improvements.
sv: API-fÃ¶rbÃ¤ttringar.

source: Added :http:get:`/api/categories/(int:id)/statistics/`.
sv: Tillagt :http:get:`/api/categories/(int:id)/statistics/`.

source: Added :http:get:`/api/projects/(string:project)/file/`.
sv: Tillagt :http:get:`/api/projects/(string:project)/file/`.

source: Added :http:post:`/api/groups/(int:id)/admins/`.
sv: Tillagt :http:post:`/api/groups/(int:id)/admins/`.

source: Added :http:delete:`/api/groups/(int:id)/admins/(int:user_id)`.
sv: Tillagt :http:delete:`/api/groups/(int:id)/admins/(int:user_id)`.

source: Improved :http:post:`/api/translations/(string:project)/(string:component)/(string:language)/units/`.
sv: FÃ¶rbÃ¤ttrad :http:post:`/api/translations/(string:project)/(string:component)/(string:language)/units/`.

source: Added :ref:`mt-systran` automatic translation support.
sv: Lagt till :ref:`mt-systran` stÃ¶d fÃ¶r automatisk Ã¶versÃ¤ttning.

source: Docker container now validates user password strength by default, see :envvar:`WEBLATE_MIN_PASSWORD_SCORE`.
sv: Docker-containern validerar nu standardmÃ¤ssigt anvÃ¤ndarens lÃ¶senordsstyrka, se :envvar:`WEBLATE_MIN_PASSWORD_SCORE`.

source: Improved error reporting in :ref:`machine-translation-setup`.
sv: FÃ¶rbÃ¤ttrad felrapportering i :ref:`machine-translation-setup`.

source: :ref:`check-max-size` better displays rendered text.
sv: :ref:`check-max-size` visar renderad text bÃ¤ttre.

source: Admins can now specify username and full name when :ref:`invite-user`.
sv: AdministratÃ¶rer kan nu ange anvÃ¤ndarnamn och fullstÃ¤ndigt namn nÃ¤r de :ref:`invite-user`.

source: Added :ref:`check-end-interrobang`.
sv: Lagt till :ref:`check-end-interrobang`.

source: :ref:`alerts` are now refreshed when needed, not just daily.
sv: :ref:`alerts` uppdateras nu vid behov, inte bara dagligen.

source: :doc:`/devel/reporting` uses specific word count for CJK languages.
sv: :doc:`/devel/reporting` anvÃ¤nder specifikt ordrÃ¤kning fÃ¶r CJK-sprÃ¥k.

source: Team membership changes are now tracked in :ref:`audit-log`.
sv: Ãndringar i teammedlemskap spÃ¥ras nu i :ref:`audit-log`.

source: :ref:`check-check-glossary` works better for languages not using whitespace.
sv: :ref:`check-check-glossary` fungerar bÃ¤ttre fÃ¶r sprÃ¥k som inte anvÃ¤nder blanktecken.

source: :ref:`alerts` better handle non-latin source languages.
sv: :ref:`alerts` hanterar bÃ¤ttre icke-latinska kÃ¤llsprÃ¥k.

source: :ref:`check-max-size` sometimes ignored ``font-spacing:SPACING`` flag.
sv: :ref:`check-max-size` ignorerar ibland flaggan ``font-spacing:SPACING``.

source: Fixed per-language statistics on nested categories.
sv: Fast statistik per sprÃ¥k fÃ¶r kapslade kategorier.

source: Fixed categories listing on per-language pages.
sv: Fast kategoriuppstÃ¤llning pÃ¥ sidor per sprÃ¥k.

source: Fixed :guilabel:`Needs editing` state calculation.
sv: Fixat :guilabel:`BehÃ¶ver redigeras`-statusberÃ¤kning.

source: Fixed changing :ref:`component-push` with :ref:`vcs-gerrit`.
sv: Fixat Ã¤ndring av :ref:`component-push` med :ref:`vcs-gerrit`.

source: Fixed using categorized components in :ref:`manage`, :ref:`memory` or :ref:`auto-translation`.
sv: Fixat med hjÃ¤lp av kategoriserade komponenter i :ref:`manage`, :ref:`memory` eller :ref:`auto-translation`.

source: Several API calls might be affected by stricter validation of boolean fields by Django REST Framework. For example :http:post:`/api/projects/(string:project)/components/`.
sv: Flera API-anrop kan pÃ¥verkas av strÃ¤ngare validering av booleska fÃ¤lt av Django REST Framework. Till exempel :http:post:`/api/projects/(string:project)/components/`.

source: Uniqueness of name and slug of a component is now enforced at the database level on PostgreSQL 15+.
sv: Unikhet fÃ¶r namn och slug fÃ¶r en komponent tillÃ¤mpas nu pÃ¥ databasnivÃ¥ i PostgreSQL 15+.

source: Docker image now ships Python packages in :file:`/app/venv` and installs using :program:`uv`.
sv: Docker-bilden levereras nu med Python-paket i :file:`/app/venv` och installeras med :program:`uv`.

source: There are several changes in :file:`settings_example.py`, most notable is changes in ``INSTALLED_APPS`` and ``LOGOUT_REDIRECT_URL``, please adjust your settings accordingly.
sv: Det finns flera Ã¤ndringar i :file:`settings_example.py`, mest noterbara Ã¤r Ã¤ndringarna i ``INSTALLED_APPS`` och ``LOGOUT_REDIRECT_URL``, vÃ¤nligen justera dina instÃ¤llningar dÃ¤refter.

source: Weblate now requires Python 3.10 and Django 5.0.
sv: Weblate krÃ¤ver nu Python 3.10 och Django 5.0.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/111?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/111?closed=1>`__.

source: *Released on March 26th 2024.*
sv: *SlÃ¤pptes den 26 mars 2024.*

source: Superuser access to components with :ref:`component-restricted`.
sv: SuperanvÃ¤ndarÃ¥tkomst till komponenter med :ref:`component-restricted`.

source: Adjusted default ``LOGIN_REQUIRED_URLS_EXCEPTIONS`` to not block :ref:`manage-appearance`.
sv: Justerade standardinstÃ¤llningen ``LOGIN_REQUIRED_URLS_EXCEPTIONS`` sÃ¥ att den inte blockerar :ref:`manage-appearance`.

source: Avoid crash on pushing changes to diverged repository.
sv: Undvik krasch nÃ¤r du Ã¶verfÃ¶r Ã¤ndringar till divergerande arkiv.

source: Avoid crash when installing :ref:`addon-weblate.generate.pseudolocale`.
sv: Undvik krasch vid installation av :ref:`addon-weblate.generate.pseudolocale`.

source: :ref:`azure-setup` gracefully handles repositories with spaces in URL.
sv: :ref:`azure-setup` hanterar elegant repositorier med mellanslag i URL.

source: :ref:`mt-deepl` gracefully handles glossaries for language variants.
sv: :ref:`mt-deepl` hanterar elegant ordlistor fÃ¶r olika sprÃ¥kvarianter.

source: :doc:`/formats/excel` better handles blank cells.
sv: :doc:`/formats/excel` hanterar tomma celler bÃ¤ttre.

source: Fixed possible data loss when merging gettext PO file changes in Git.
sv: Ã tgÃ¤rdat mÃ¶jligt datafÃ¶rlust vid sammanslagning av Ã¤ndringar i gettext PO-filer i Git.

source: Repository operations on project could have skipped some components.
sv: Repository-Ã¥tgÃ¤rderna fÃ¶r projektet kan ha hoppat Ã¶ver vissa komponenter.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/115?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/115?closed=1>`__.

source: *Released on February 22nd 2024.*
sv: *SlÃ¤pptes den 22 februari 2024.*

source: Displaying debugging page in case of database connection issues.
sv: Visar felsÃ¶kningssidan vid problem med databasanslutningen.

source: Gracefully handle migration with duplicate built-in teams.
sv: Hantera migreringen smidigt med dubbla inbyggda team.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/113?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/113?closed=1>`__.

source: *Released on February 19th 2024.*
sv: *SlÃ¤pptes den 19 februari 2024.*

source: Possible crash on Weblate upgrade check when cached from the previous versions.
sv: MÃ¶jlig krasch vid uppgraderingskontroll i Weblate nÃ¤r cacheminnet frÃ¥n tidigare versioner anvÃ¤nds.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/112?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/112?closed=1>`__.

source: *Released on February 15th 2024.*
sv: *SlÃ¤pptes den 15 februari 2024.*
